export function aromaOptions(wineType: string) {
  if (wineType === "red") {
    return {
      firstImpressionOptions: [
        "閉じている",
        "控えめ",
        "開いている",
        "強い",
        "チャーミングな",
        "華やかな",
        "濃縮感がある",
        "深みのある",
        "複雑な"
      ],
      fruitOptions: [
        "イチゴ",
        "ラズベリー",
        "ブルーベリー",
        "カシス",
        "ブラックベリー",
        "ブラックチェリー",
        "干しプラム",
        "乾燥イチジク"
      ],
      flowerOptions: [
        "バラ",
        "すみれ",
        "牡丹",
        "ゼラニウム",
        "赤ピーマン",
        "メントール",
        "シダ",
        "ローリエ",
        "杉",
        "針葉樹",
        "ユーカリ",
        "ドライハーブ",
        "タバコ",
        "紅茶",
        "キノコ",
        "腐葉土",
        "土"
      ],
      spiceOptions: [
        "血液",
        "生肉",
        "乾いた肉",
        "なめし革",
        "ロースト",
        "コーヒー",
        "カカオ",
        "バニラ",
        "黒胡椒",
        "丁子",
        "シナモン",
        "ナツメグ",
        "甘草",
        "杜松の実",
        "タール",
        "樹脂",
        "ヨード"
      ],
      aromaImpressionOptions: [
        "若々しい",
        "嫌気的な",
        "熟成感があらわれている",
        "酸化熟成の段階",
        "酸化している",
        "第1アロマが強い",
        "第2アロマが強い",
        "ニュートラル",
        "木樽からのニュアンス"
      ]
    }
  } else { // White
    return {
      firstImpressionOptions: [
        "閉じている",
        "控えめ",
        "開いている",
        "強い",
        "チャーミングな",
        "華やかな",
        "濃縮感がある",
        "深みのある",
        "複雑な"
      ],
      fruitOptions: [
        "柑橘類",
        "青リンゴ",
        "リンゴ",
        "洋梨",
        "メロン",
        "マスカット",
        "花梨",
        "白桃",
        "アプリコット",
        "パイナップル",
        "パッションフルーツ",
        "ライチ",
      ],
      flowerOptions: [
        "すいかずら",
        "アカシア",
        "白バラ",
        "金木犀",
        "菩提樹",
        "ミント",
        "アニス",
        "ヴェルヴェーヌ",
        "アーモンド",
        "ヘーゼルナッツ"
      ],
      spiceOptions: [
        "貝殻",
        "石灰",
        "火打石",
        "ヨード",
        "トースト",
        "カラメル",
        "ヴァニラ",
        "コリアンダー",
        "白胡椒",
        "丁子",
        "香木",
        "硫黄",
        "パン・ド・ミ",
        "蜂蜜",
        "バター",
        "樹脂",
        "ジャコウ",
        "花の蜜"
      ],
      aromaImpressionOptions: [
        "若々しい",
        "嫌気的な",
        "熟成感があらわれている",
        "酸化熟成の段階",
        "酸化している",
        "第1アロマが強い",
        "第2アロマが強い",
        "ニュートラル",
        "木樽からのニュアンス",
        "複雑性がある"
      ]
    }
  }
}
