export function conclusionOptions(wineType: string) {
  if (wineType === "red") {
    return {
      evaluationOptions: [
        "シンプル、フレッシュ感を楽しむ",
        "エレガントで余韻の長い",
        "成熟度が高く豊か",
        "濃縮し力強い",
        "ポテンシャルがある"
      ],
      temperatureOptions: [
        "10度未満",
        "10-13度",
        "14-16度",
        "17-20度",
        "21度以上"
      ],
      glassOptions: ["小ぶり", "中庸", "大ぶり"],
      decantageOptions: ["必要なし", "直前", "事前(1時間以上前)"],
      vintageOptions: [
        "今年",
        "1昨年",
        "2年前",
        "5年程前",
        "10年程前",
        "15年以上前"
      ],
      countryOptions: [
        "フランス",
        "オーストラリア",
        "アメリカ",
        "日本",
        "ニュージーランド",
        "ドイツ",
        "スペイン",
        "アルゼンチン",
        "イタリア",
        "チリ"
      ],
      grapeOptions: [
        "カベルネ・ソーヴィニヨン",
        "シラー(シラーズ)",
        "ピノ・ノワール",
        "サンジョベーゼ",
        "メルロ",
        "ガメ",
        "カベルネ・フラン",
        "テンプラニーリョ",
        "グルナッシュ",
        "ネッビオーロ",
        "ジンファンデル"
      ]
    }
  } else { // White
    return {
      evaluationOptions: [
        "シンプル、フレッシュ感を楽しむ",
        "エレガントでミネラリー",
        "成熟度が高く豊か",
        "濃縮し力強い",
        "ポテンシャルがある"
      ],
      temperatureOptions: [
        "8度未満",
        "8-10度",
        "11-14度",
        "15-18度",
        "19度以上"
      ],
      glassOptions: ["小ぶり", "中庸", "大ぶり"],
      decantageOptions: ["必要なし", "直前", "事前(1時間以上前)"],
      vintageOptions: [
        "今年",
        "1昨年",
        "2年前",
        "5年程前",
        "10年程前",
        "15年以上前"
      ],
      countryOptions: [
        "フランス",
        "オーストラリア",
        "アメリカ",
        "日本",
        "ニュージーランド",
        "ドイツ",
        "スペイン",
        "アルゼンチン",
        "イタリア",
        "チリ"
      ],
      grapeOptions: [
        "シャルドネ",
        "リースリング",
        "ソーヴィニョン・ブラン",
        "ミュスカデ",
        "甲州",
        "アリゴテ",
        "ゲヴュルツトラミネール",
        "シュナン・ブラン"
      ]
    }
  }
}
