export function tasteOptions(wineType: string) {
  if (wineType === "red") {
    return {
      attackOptions: [
        "軽い",
        "やや軽い",
        "やや強い",
        "強い",
        "インパクトのある"
      ],
      sweetnessOptions: [
        "ドライ",
        "ソフトな",
        "まろやか",
        "豊かな",
        "残糖がある"
      ],
      acidityOptions: [
        "キメ細かい",
        "やさしい",
        "円みのある",
        "なめらかな",
        "爽やかな",
        "ストレートな",
        "シャープな",
        "力強い"
      ],
      tanninOptions: [
        "サラサラとした",
        "緻密",
        "力強い",
        "収斂性のある",
        "ヴィロードのような",
        "シルキーな",
        "溶け込んだ"
      ],
      balanceOptions: [
        "スマートな",
        "骨格のしっかりした",
        "固い",
        "痩せた、渇いた",
        "豊満な",
        "肉厚な",
        "力強い",
        "流れるような",
        "ふくよかな"
      ],
      alcoholOptions: [
        "軽め",
        "やや軽め",
        "中程度",
        "やや強め",
        "熱さを感じる"
      ],
      aftertasteOptions: ["短い", "やや短い", "やや長い", "長い"]
    }
  } else { // White
    return {
      attackOptions: [
        "軽い",
        "やや軽い",
        "やや強い",
        "強い",
        "インパクトのある"
      ],
      sweetnessOptions: [
        "ドライ",
        "ソフトな",
        "まろやか",
        "豊かな",
        "残糖がある"
      ],
      acidityOptions: [
        "キメ細かい",
        "やさしい",
        "爽やかな",
        "ストレートな",
        "しっかりとした",
        "力強い"
      ],
      tanninOptions: [
        "控えめ",
        "穏やかな",
        "コクを与える",
        "旨味を伴った",
        "強い"
      ],
      balanceOptions: [
        "スリムな",
        "スムースな",
        "溌剌とした",
        "ドライな",
        "まろやかな",
        "ねっとりした",
        "コンパクトな",
        "フラットな",
        "豊潤な",
        "厚みのある",
        "ふくよかな"
      ],
      alcoholOptions: [
        "軽め",
        "やや軽め",
        "中程度",
        "やや強め",
        "強い",
        "熱さを感じる"
      ],
      aftertasteOptions: ["短い", "やや短い", "やや長い", "長い"]
    }
  }
}
